using System;

/**
 * 1. Написать метод возвращающий минимальное из трех чисел.
 */

namespace task2_1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
